import streamlit as st
import pandas as pd


def app():

    data = {
        "制作物名": [
            "プラコンⅠ",
            "カルニウムⅠ",
            "バシクスⅠ",
            "学院の武器魔石",
            "学院の防具魔石",
            "学院の装飾魔石",
            "オリデオコン",
            "エルニウム",
            "ブラディウム",
            "STRストーンⅠ",
            "AGIストーンⅠ",
            "INTストーンⅠ",
            "VITストーンⅠ",
            "LUKストーンⅠ",
            "DEXストーンⅠ",
            "鉄Ⅰ",
            "銀Ⅰ",
            "金Ⅰ",
            "プラコンⅡ",
            "カルニウムⅡ",
            "バシクスⅡ",
            "灼熱の武器魔石",
            "灼熱の防具魔石",
            "灼熱の装飾魔石",
            "濃縮オリデオコン",
            "濃縮エルニウム",
            "濃縮ブラディウム",
            "武器祝福石Ⅰ",
            "防具祝福石Ⅰ",
            "装飾祝福石Ⅰ",
            "武器保護石Ⅰ",
            "防具保護石Ⅰ",
            "装飾保護石Ⅰ",
            "プラコンⅢ",
            "カルニウムⅢ",
            "バシクスⅢ",
            "潮流の武器魔石",
            "潮流の防具魔石",
            "潮流の装飾魔石",
            "STRストーンⅡ",
            "AGIストーンⅡ",
            "INTストーンⅡ",
            "VITストーンⅡ",
            "LUKストーンⅡ",
            "DEXストーンⅡ",
            "鉄Ⅱ",
            "銀Ⅱ",
            "金Ⅱ",
            "残魂の武器魔石",
            "残魂の防具魔石",
            "残魂の装飾魔石",
            "濃縮オリデオコンⅡ",
            "濃縮エルニウムⅡ",
            "濃縮ブラディウムⅡ",
            "武器祝福石Ⅱ",
            "防具祝福石Ⅱ",
            "装飾祝福石Ⅱ",
            "武器保護石Ⅱ",
            "防具保護石Ⅱ",
            "装飾保護石Ⅱ",
            "プラコンⅣ",
            "カルニウムⅣ",
            "バシクスⅣ",
            "水晶の武器魔石",
            "水晶の防具魔石",
            "水晶の装飾魔石",
        ],
        "材料": [
            ["強化金属Lv.1", "貝殻"],
            ["強化金属Lv.1", "トルコ石"],
            ["強化金属Lv.1", "玉石"],
            ["魔力鉱石Lv.1", "水晶茸"],
            ["魔力鉱石Lv.1", "強靭な蔓"],
            ["魔力鉱石Lv.1", "神秘の花"],
            ["オリデオコン原石Lv.1", "石炭石Lv.1"],
            ["エルニウム原石Lv.1", "石炭石Lv.1"],
            ["ブラディウム原石Lv.1", "石炭石Lv.1"],
            ["透明な宝石の原石Lv.1", "バイ貝"],
            ["不透明な宝石の原石Lv.1", "アカヒレ"],
            ["透明な宝石の原石Lv.1", "チョウザメ"],
            ["不透明な宝石の原石Lv.1", "バイ貝"],
            ["透明な宝石の原石Lv.1", "アカヒレ"],
            ["不透明な宝石の原石Lv.1", "チョウザメ"],
            ["鉄鉱石Lv.1", "石炭石Lv.1"],
            ["銀鉱石Lv.1", "石炭石Lv.1"],
            ["金鉱石Lv.1", "石炭石Lv.1"],
            ["強化金属Lv.2", "ゴールドフィッシュ"],
            ["強化金属Lv.2", "エバリア蟹"],
            ["強化金属Lv.2", "バラムツ"],
            ["魔力鉱石Lv.2", "アマンカイ"],
            ["魔力鉱石Lv.2", "炎地茸"],
            ["魔力鉱石Lv.2", "枯れ荊"],
            ["オリデオコン原石Lv.2", "チョウチンアンコウ"],
            ["エルニウム原石Lv.2", "ヒラマキ貝"],
            ["ブラディウム原石Lv.2", "アコヤ貝"],
            ["祝福された鉱石Lv.1", "アマクサクラゲ"],
            ["祝福された鉱石Lv.1", "ハゼ"],
            ["祝福された鉱石Lv.1", "アカハタ"],
            ["保護された鉱石Lv.1", "ストーンフルーツ"],
            ["保護された鉱石Lv.1", "白トゲの実"],
            ["保護された鉱石Lv.1", "デザートウェルウィッチア"],
            ["強化金属Lv.3", "ホタテ貝"],
            ["強化金属Lv.3", "タケノコ貝"],
            ["強化金属Lv.3", "ハマグリ"],
            ["魔力鉱石Lv.3", "アジサイ"],
            ["魔力鉱石Lv.3", "イテア"],
            ["魔力鉱石Lv.3", "晩蛍草"],
            # gamewith_Lv.6素材抜け
            ["透明な宝石の原石Lv.2", "スティーレポルス"],
            ["不透明な宝石の原石Lv.2", "魚竜"],
            ["透明な宝石の原石Lv.2", "虹色珊瑚"],
            ["不透明な宝石の原石Lv.2", "スティーレポルス"],
            ["透明な宝石の原石Lv.2", "魚竜"],
            ["不透明な宝石の原石Lv.2", "虹色珊瑚"],
            ["鉄鉱石Lv.2", "石炭石Lv.2"],
            ["銀鉱石Lv.2", "石炭石Lv.2"],
            ["金鉱石Lv.2", "石炭石Lv.2"],
            ["魔力鉱石Lv.4", "陰気草"],
            ["魔力鉱石Lv.4", "赤色花苗"],
            ["魔力鉱石Lv.4", "静謐花"],
            ["オリデオコン原石Lv.3", "ぺーシュカショーロ"],
            ["エルニウム原石Lv.3", "ベタ"],
            ["ブラディウム原石Lv.3", "水真珠"],
            ["祝福された鉱石Lv.2", "オアカムロ"],
            ["祝福された鉱石Lv.2", "イシガニ"],
            ["祝福された鉱石Lv.2", "ボラ貝"],
            ["保護された鉱石Lv.2", "岩コケ"],
            ["保護された鉱石Lv.2", "暗光キノコ"],
            ["保護された鉱石Lv.2", "亡魂ツル"],
            ["強化金属Lv.4", "カマス"],
            ["強化金属Lv.4", "シクリッド"],
            ["強化金属Lv.4", "シーラカンス"],
            ["魔力鉱石Lv.4", "ケラトスティグマ"],
            ["魔力鉱石Lv.4", "黙祷花"],
            ["魔力鉱石Lv.4", "ブルーローズ"],
        ],
        "必要数": [
            [10, 1],
            [10, 1],
            [10, 1],
            [5, 1],
            [5, 1],
            [5, 1],
            [8, 5],
            [8, 5],
            [8, 5],
            [10, 4],
            [10, 4],
            [10, 4],
            [10, 4],
            [10, 4],
            [10, 4],
            [12, 12],
            [12, 12],
            [12, 12],
            [9, 2],
            [9, 2],
            [9, 2],
            [8, 1],
            [8, 1],
            [8, 1],
            [7, 9],
            [7, 9],
            [7, 9],
            [7, 6],
            [7, 6],
            [7, 6],
            [7, 9],
            [7, 9],
            [7, 9],
            [12, 3],
            [12, 3],
            [12, 3],
            [6, 3],
            [6, 3],
            [6, 3],
            # gamewhit_Lv6素材抜け
            [30, 12],
            [30, 12],
            [30, 12],
            [30, 12],
            [30, 12],
            [30, 12],
            [35, 35],
            [35, 35],
            [35, 35],
            [8, 4],
            [8, 4],
            [8, 4],
            [15, 12],
            [15, 12],
            [15, 12],
            [15, 8],
            [15, 8],
            [15, 8],
            [15, 12],
            [15, 12],
            [15, 12],
            # gamewith_Lv7
            [15, 4],
            [15, 4],
            [15, 4],
            [18, 7],
            [18, 7],
            [18, 7],
        ],
    }

    # print(len(data["制作物名"]), len(data["材料"]), len(data["必要数"]))

    # データベースとしてDataFrameを作成
    df = pd.DataFrame(data)

    # UI部分
    st.title("精錬素材計算")
    # st.write("精錬素材計算機です。")
    # st.write("作りたい制作物を選択し、個数を入力してください。")
    # st.write("良い感じに使ってみてください。")

    # 制作物選択
    selected_item = st.selectbox("制作物を選択", df["制作物名"])

    # 制作個数入力
    quantity = st.number_input(
        "作りたい個数", min_value=1, step=1, value=1, key="seiren_quantity"
    )

    # 制作物の情報を取得
    if selected_item:
        try:
            item_data = df[df["制作物名"] == selected_item].iloc[0]
            materials = item_data["材料"]
            material_counts = item_data["必要数"]

            # 必要素材の計算
            required_materials = {
                material: count * quantity
                for material, count in zip(materials, material_counts)
            }

            # 結果を表示
            st.write(
                f"**{selected_item}** を **{quantity}個** 作るには以下の素材が必要です："
            )
            for material, count in required_materials.items():
                st.write(f"- {material}: {count}個")
        except Exception as e:
            st.error(f"エラーが発生しました: {e}")
